ox_docs/corners/david/distalgs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-26 Sun 09:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Distributed Algorithms</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
<link rel="stylesheet" href="https://raw.githubusercontent.com/PrismJS/prism-themes/master/themes/prism-atom-dark.css" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Distributed Algorithms</h1> <h2 class="subtitle"></h2> <span class="author">Taproot</span> <span class="date">2021-09-24 Fri 13:59</date></div>
</div>
<div id="content">
<h1 class="title">Distributed Algorithms</h1>

<div id="outline-container-orgda539ec" class="outline-2">
<h2 id="orgda539ec"><span class="section-number-2">1</span> What are distributed algorithms?</h2>
<div class="outline-text-2" id="text-1">
<p>
(<a href="https://stanford.edu/~rezab/dao/">https://stanford.edu/~rezab/dao/</a>)
• Algorithms designed to run on multi-core processors by splitting up
into subroutines that simultaneously run on separate processors, saving
time. 
• The general field of algorithm hardware optimization includes
design algorithms to be run on GPUs and CPUs or even TPUs. &#x2013; TPU stands
for Tensor Processing Unit and is a chip developed by Google to aid
systems running TensorFlow
</p>
</div>
</div>

<div id="outline-container-org860d606" class="outline-2">
<h2 id="org860d606"><span class="section-number-2">2</span> Simple example of distributed algorithm is addition</h2>
<div class="outline-text-2" id="text-2">
<p>
• Normally one steps down the list and adds to running total
• Instead, with multiple cores, delegate pairs of numbers to each core and compute
the sum, reducing the list to n/2. Recursively repeat this until the
list is only one element to calculate the sum in O(log 2) time.
</p>
</div>
</div>

<div id="outline-container-org2fb1525" class="outline-2">
<h2 id="org2fb1525"><span class="section-number-2">3</span> Modelling</h2>
<div class="outline-text-2" id="text-3">
<p>
• Normally the model is of the Random Access Machine, where a processor
is connected to memory and every operation takes a constant time step.
• Not as straightforward for distributed algorithms
</p>
</div>
</div>

<div id="outline-container-org4f0ba75" class="outline-2">
<h2 id="org4f0ba75"><span class="section-number-2">4</span> Multiprocessor Models</h2>
<div class="outline-text-2" id="text-4">
<p>
• Random Access Machine model but with additional processors. 
• Three seperate submodels with different methods of accessing memory. 
&#x2013; Local memory machine models each processor as having its own memory 
&#x2013; Modular memory machine models each processor as being routed to m processors 
&#x2013; PRAM models each processor as sharing memory with each other processor 
&#x2014; Benefits include accessing memory in single step 
&#x2014; Not widely believed that this model (in how it can access memory in single step) is
realistic 
</p>
</div>
</div>

<div id="outline-container-org2281e5f" class="outline-2">
<h2 id="org2281e5f"><span class="section-number-2">5</span> Techniques</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgdbf357f" class="outline-3">
<h3 id="orgdbf357f"><span class="section-number-3">5.1</span> Divide and Conquer</h3>
<div class="outline-text-3" id="text-5-1">
<p>
• Divide and Conquer (or splitting the problem into easier subproblems)
is useful in a sequential context, and extra useful in a parallel
context. 
&#x2013; Subproblems are usually independent of one another, and
therefore can benefit from being calculated in parallel. 
• Merge sort is one good example, as its usual time complexity is O(n log n)
</p>
</div>
</div>
</div>

<div id="outline-container-orga67a8a8" class="outline-2">
<h2 id="orga67a8a8"><span class="section-number-2">6</span> In-class Lecture</h2>
<div class="outline-text-2" id="text-6">
<p>
• Around for ~25 years but more relevant in last 10
because many cores has become more of a reality. 
• Distribute tasks accross core
</p>
</div>

<div id="outline-container-orgb5ed8a0" class="outline-3">
<h3 id="orgb5ed8a0"><span class="section-number-3">6.1</span> Area 1: Distributing Algorithms</h3>
<div class="outline-text-3" id="text-6-1">
<p>
• Atomicity &#x2013; Either all operations are run or none of them so as to
prevent error 
• Leader election &#x2013; Sometimes a core needs to be a "leader" 
• Consensus &#x2013; Processes must agreee
</p>
</div>
</div>

<div id="outline-container-org13c71a2" class="outline-3">
<h3 id="org13c71a2"><span class="section-number-3">6.2</span> Area 2: Designing Algorithms to be Distributed</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orge11bbe5" class="outline-4">
<h4 id="orge11bbe5"><span class="section-number-4">6.2.1</span> Map-Reduce</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
• Map: (inkey , invalue ) -&gt; list(outkey, intermediate value ) &#x2013; Write
a function that gives each document to a different core, and count
number of occurences in document. 
• Reduce: Collect responses and combine 
• Benefit is just structuring the problem in the framework
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
